Revit 2027 API
RectangleLightShape(RectangleLightShape) Constructor
 Creates a copy of the given rectangle light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RectangleLightShape(
	RectangleLightShape other
)
Public Sub New (
	other As RectangleLightShape
)
public:
RectangleLightShape(
	RectangleLightShape^ other
)
new :
        other : RectangleLightShape -> RectangleLightShape
Parameters
other RectangleLightShape
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RectangleLightShape Class
RectangleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace